app/controllers/api/transactions_controller.rb

    def create
        user_id = params[:user_id]
        asset = params[:asset]
        price = params[:price]
        amount = params[:amount]
        amount_usd = params[:amount_usd]

        # suppose to wait for validation

        @transaction = Transaction.create(
            :user_id => user_id,
            :asset => asset,
            :price => price,
            :amount => amount,
            :amount_usd => amount_usd
        )
---
INSERT INTO "transactions" ("asset", "price", "amount", "amount_usd", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["asset", "BTC"], ["price", 700000], ["amount", 1.0], ["amount_usd", 12345], ["user_id", 1], ["created_at", "2019-12-06 22:24:22.842246"], ["updated_at", "2019-12-06 22:24:22.842246"]]

    def show
        @transcations = Transaction.all
---
SELECT "transactions".* FROM "transactions"

    def by_user_id
        @transactions = Transaction.where(['user_id =:u', {u: params[:user_id]}])
---
SELECT "transactions".* FROM "transactions" WHERE (user_id ='1')