app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "GL3VI0pVB_Ou8kLRcsXIOA"], ["updated_at", "2019-11-05 18:10:39.551978"], ["id", 4]]